[
  {
    "model": "catalog.category",
    "pk": 1,
    "fields": {
      "title": "Смартфоны",
      "description": "Смартфон - это мобильное устройство, в котором сочетается функционал сотового телефона и компьютера."
    }
  },
  {
    "model": "catalog.category",
    "pk": 2,
    "fields": {
      "title": "Ноутбуки",
      "description": "Ноутбук — переносной компьютер, в корпусе которого объединены типичные компоненты персонального компьютера, включая дисплей, клавиатуру и устройство указания (обычно сенсорная панель или тачпад), а также аккумуляторные батареи."
    }
  },
  {
    "model": "catalog.category",
    "pk": 3,
    "fields": {
      "title": "Видеокарты",
      "description": "Видеокарта — устройство, преобразующее графический образ, хранящийся как содержимое памяти компьютера (или самого адаптера), в форму, пригодную для дальнейшего вывода на экран монитора."
    }
  },
  {
    "model": "catalog.product",
    "pk": 1,
    "fields": {
      "title": "iPhone 14",
      "description": "Смартфон Apple iPhone 14 128 ГБ – компактная модель с безрамочным дисплеем OLED 6.1 дюйма. Металлический корпус мобильного устройства соответствует стандарту защищенности IP68 – он устойчив к воздействию влаги и пыли. Передняя панель обладает покрытием Ceramic Shield для защиты экрана от появления царапин и различных дефектов.\r\nОсновная сдвоенная камера 12+12 Мп со вспышкой True Tone и целым рядом режимов позволяет создавать снимки профессионального качества в любых условиях освещенности. Камера 12 Мп на передней стороне предназначена для селфи и качественной видеосвязи. Среди особенностей Apple iPhone 14 – чип Apple A15 Bionic с 5-ядерным GPU, широкий набор интерфейсов (NFC, 5G, GPS, Wi-Fi и Bluetooth), длительное время автономности, поддержка аксессуаров и устройств MagSafe с магнитной беспроводной зарядкой.",
      "image": "catalog/iPhone14.jpg.webp",
      "category": 1,
      "purchase_price": 89000,
      "date_of_creation": "2023-08-17",
      "date_of_last_modification": "2023-08-20"
    }
  },
  {
    "model": "catalog.product",
    "pk": 2,
    "fields": {
      "title": "iPhone 12",
      "description": "Это iPhone 12. Великолепный яркий дисплей Super Retina XDR 6,1 дюйма. Передняя панель Ceramic Shield, с которой риск повреждений дисплея при падении в 4 раза ниже. Потрясающее качество снимков при слабом освещении благодаря Ночному режиму на всех камерах. Съёмка, монтаж и воспроизведение видео кинематографического качества в стандарте Dolby Vision. Мощный процессор A14 Bionic. И аксессуары MagSafe, которые мгновенно примагничиваются и обеспечивают более быструю беспроводную зарядку. Другими словами, вас ждут яркие открытия.",
      "image": "catalog/iPhone12.jpg.webp",
      "category": 1,
      "purchase_price": 69500,
      "date_of_creation": "2023-08-17",
      "date_of_last_modification": "2023-09-08"
    }
  },
  {
    "model": "catalog.product",
    "pk": 3,
    "fields": {
      "title": "Samsung galaxy s23 ultra",
      "description": "Смартфон Samsung Galaxy S23 Ultra 256 ГБ выполнен в прямоугольном корпусе черного цвета и предлагает флагманские функции для требовательных пользователей. Корпус соответствует стандарту защищенности IP68, что делает устройство устойчивым к воздействию влаги и пыли. На передней стороне используется прочное стекло Corning Gorilla Glass Victus 2 для защиты от царапин и повреждений. Аппаратная платформа с процессором Snapdragon 8 Gen 2 и 12 ГБ оперативной памяти обеспечивает производительность приложений.\r\nSamsung Galaxy S23 Ultra оснащен изогнутым экраном 6.8 дюйма с технологией Dynamic AMOLED 2X и частотой 120 Гц, на котором отображается реалистичная картинка. Основная камера представлена датчиками 200+12+10+10 Мп, что при поддержке автофокуса, оптической стабилизации и вспышки LED обеспечивает создание реалистичных снимков. На передней стороне расположен модуль камеры 12 Мп для селфи и общения по видеосвязи. Среди особенностей смартфона – интерфейсы беспроводной связи Wi-Fi и Bluetooth, стереодинамики, аккумулятор 5000 мА*ч с поддержкой функции беспроводной и быстрой зарядки.",
      "image": "catalog/samsung.jpg.webp",
      "category": 1,
      "purchase_price": 110000,
      "date_of_creation": "2023-08-17",
      "date_of_last_modification": "2023-08-20"
    }
  },
  {
    "model": "catalog.product",
    "pk": 4,
    "fields": {
      "title": "Apple MacBook Pro",
      "description": "Ноутбук Apple MacBook Pro – элегантный серебристый прибор с 16-дюймовым IPS-экраном и 6-ядерным процессором Intel, а также сканером отпечатка пальца. Дисплей обладает разрешением 3072x1920 dpi и дополняется глянцевым покрытием для улучшения насыщенности и контрастности. Клавиатура без цифрового блока дополнена яркой подсветкой. Быстрый отклик на команды обеспечивается благодаря 16 ГБ ОЗУ DDR4. Аккумулятор позволяет работать без света в течение 11-ти часов.\r\nОборудование Apple MacBook Pro оснащено видеопамятью 4 ГБ GDDR6 и SSD-накопителем на 512 ГБ, гарантирующим быстрый запуск системы и отсутствие сбоев при работе мощных приложений. Ноутбук дополнен системой из шести динамиков Hi-Fi и акустикой Dolby Atmos, камерой с микрофоном, модулями Wi-Fi и Bluetooth. Также имеется 4 видеоразъема Thunderbolt 3, один из которых совмещен с USB 3.1 Type-C, стандартный аудиоразъем для наушников и 4 USB-порта.",
      "image": "catalog/MacBook.jpg.webp",
      "category": 2,
      "purchase_price": 105000,
      "date_of_creation": "2023-08-17",
      "date_of_last_modification": "2023-09-08"
    }
  },
  {
    "model": "catalog.product",
    "pk": 5,
    "fields": {
      "title": "Acer Nitro 5",
      "description": "Ноутбук Acer Nitro 5 AN515-57-59F2 разработан для достижения мощного вычислительного потенциала в играх и требовательных программах. Аппаратная конфигурация представлена процессором Intel семейства Core i5, 16 ГБ ОЗУ, видеокартой GeForce RTX 3050 Ti от NVIDIA и накопителем SSD 512 ГБ. Стабильный режим при любых нагрузках обеспечивается эффективной системой охлаждения с вентиляторами.\r\nAcer Nitro 5 оснащен экраном 15.6 дюйма IPS FullHD с частотой 144 Гц. Красная светодиодная подсветка повышает комфорт игры в условиях недостаточной освещенности. Аудиосистема со стереодинамиками помогает погрузиться в реалистичный звук. С боковых сторон расположено множество портов и разъемов: LAN, USB, HDMI, аудио. Для беспроводной синхронизации реализованы интерфейсы Wi-Fi и Bluetooth. Литий-полимерный аккумулятор гарантирует продолжительное время автономности – около 8 часов.",
      "image": "catalog/Acer.jpg.webp",
      "category": 2,
      "purchase_price": 96000,
      "date_of_creation": "2023-08-17",
      "date_of_last_modification": "2023-08-20"
    }
  },
  {
    "model": "catalog.product",
    "pk": 6,
    "fields": {
      "title": "MSI Bravo 15",
      "description": "Ноутбук MSI Bravo 15 C7VF-039XRU – мощная геймерская платформа. В ней сочетаются высокая производительность и технологичность, необходимые для преимущества на поле виртуального сражения. Экран 15.6 дюйма IPS FullHD обеспечивает детализированную картинку с красочными цветами и широкими углами обзора. Для удобства управления установлены эргономичная клавиатура с голубой LED-подсветкой и тачпад.\r\nВычислительный потенциал высокого уровня достигается благодаря процессору AMD Ryzen 5 7535HS, 16 ГБ ОЗУ и видеокарте GeForce RTX 4060. Под размещение пользовательских файлов предусмотрен диск SSD вместимостью 512 ГБ. Фирменная система охлаждения Cooler Boost 5 поддерживает стабильную температуру компонентов. Одного заряда литий-полимерного аккумулятора достаточно для 6 часов автономности MSI Bravo 15 C7VF-039XRU.",
      "image": "catalog/MSI.jpg.webp",
      "category": 2,
      "purchase_price": 99000,
      "date_of_creation": "2023-08-17",
      "date_of_last_modification": "2023-08-20"
    }
  },
  {
    "model": "catalog.product",
    "pk": 7,
    "fields": {
      "title": "GIGABYTE GeForce RTX 4090",
      "description": "Видеокарта GIGABYTE GeForce RTX 4090 GAMING OC предлагает высокую производительность и широкие графические возможности при поддержке искусственного интеллекта. Модель с архитектурой NVIDIA Ada Lovelace и 24 ГБ памяти стандарта GDDR6X создана для игр и разработки контента. Тактовая частота процессора составляет 2230 МГц.\r\nИз интерфейсов с боковой стороны видеокарты предлагаются 3 разъема DisplayPort и 1 разъем HDMI. Активное охлаждение с двумя вентиляторами быстро рассеивает тепло и поддерживает низкую температуру нагрева. Плата с усиленной подсистемой питания, отборные компоненты и дополнительные предохранители гарантируют стабильность работы. Защитная пластина на тыловой стороне делает видеокарту устойчивой к деформации. Из преимуществ GIGABYTE GeForce RTX 4090 GAMING OC – программируемая подсветка RGB.",
      "image": "catalog/RTX_4090.png.webp",
      "category": 3,
      "purchase_price": 204000,
      "date_of_creation": "2023-08-17",
      "date_of_last_modification": "2023-08-20"
    }
  },
  {
    "model": "catalog.product",
    "pk": 8,
    "fields": {
      "title": "Radeon pro w7800",
      "description": "AMD начала продажи Radeon PRO W7800 13 апреля 2023 по рекомендованной цене 2,499$. Это топовая десктопная видеокарта на архитектуре RDNA 3.0 и техпроцессе 5 нм, в первую очередь рассчитанная на дизайнеров. На ней установлено 32 Гб памяти GDDR6 на частоте 18 Гб/с, и вкупе с 256-битным интерфейсом это создает пропускную способность 576.0 Гб/с.\r\n\r\nС точки зрения совместимости это двухслотовая карта, подключаемая по интерфейсу PCIe 4.0 x16. Длина референсной версии – 280 мм. Для подключения требуется два 8-pin дополнительных кабеля питания, а потребляемая мощность – 260 Вт.",
      "image": "",
      "category": 3,
      "purchase_price": 219000,
      "date_of_creation": "2023-08-17",
      "date_of_last_modification": "2023-08-20"
    }
  },
  {
    "model": "catalog.product",
    "pk": 10,
    "fields": {
      "title": "Nokia 3310",
      "description": "неуязвимый",
      "image": "catalog/nokia_3310.jpeg",
      "category": 1,
      "purchase_price": 3000,
      "date_of_creation": "2023-08-26",
      "date_of_last_modification": "2023-08-26"
    }
  },
  {
    "model": "catalog.product",
    "pk": 15,
    "fields": {
      "title": "motorolla",
      "description": "test",
      "image": "",
      "category": 1,
      "purchase_price": 5000,
      "date_of_creation": "2023-09-07",
      "date_of_last_modification": "2023-09-08"
    }
  },
  {
    "model": "catalog.version",
    "pk": 2,
    "fields": {
      "product": 15,
      "version_number": "v.01",
      "version_title": "Green",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 3,
    "fields": {
      "product": 4,
      "version_number": "v.13",
      "version_title": "Silver",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 4,
    "fields": {
      "product": 2,
      "version_number": "v.12",
      "version_title": "TestPhone",
      "current_version": false
    }
  }
]